app/controllers/students_controller.rb

    def index #this method is called in your ROUTES FILE!!! It comes after only:
      @students = Student.all
---
SELECT "students".* FROM "students"